In [46]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [47]:
df1 =  pd.read_csv('108.csv')

In [48]:
df2 = pd.read_csv('109.csv')

In [49]:
df3 = pd.read_csv('111.csv')

In [50]:
df1.head(5)

,review,Used it for,Owned for,Ridden for,rating,Visual Appeal,Reliability,Performance,Service Experience,Extra Features,Comfort,Maintenance cost,Value for Money,Model Name
0,We all checked the bike's capacity to be 150 k...,Daily Commute,Never owned,NaN,1,3.0,4.0,NaN,NaN,NaN,4.0,NaN,1.0,TVS iQube
1,Performance is very poor on this bike. The cha...,Everything,> 1 yr,< 5000 kms,1,3.0,1.0,NaN,1.0,NaN,3.0,NaN,3.0,TVS iQube
2,I purchased this in April 2022 and the sales s...,Daily Commute,< 3 months,< 5000 kms,3,4.0,4.0,NaN,2.0,NaN,5.0,NaN,2.0,TVS iQube
3,If any issues come in scooty parts not availab...,Daily Commute,6 months-1 yr,5000-10000 kms,1,1.0,1.0,NaN,1.0,NaN,1.0,NaN,1.0,TVS iQube
4,Don't buy this vehicle unless you have a near ...,Daily Commute,6 months-1 yr,< 5000 kms,1,3.0,4.0,NaN,1.0,NaN,3.0,NaN,2.0,TVS iQube

In [51]:
df2.head(5)

,review,Exterior,Comfort,Performance,Fuel Economy,Value for Money,Condition,driven,rating,model_name
0,Superb car like as fantastic as petroleum car....,5.0,4.0,5.0,5.0,5.0,New,Few hundred kilometers,5.0,hyundai kona
1,"Anti national, worst service, worst customer c...",1.0,1.0,1.0,1.0,1.0,New,Haven't driven it,0.0,hyundai kona
2,Super happy with it. The car is too good,4.0,5.0,5.0,5.0,4.0,New,Few thousand kilometers,5.0,hyundai kona
3,"Pretty good car, smooth as a glider fast car, ...",5.0,5.0,5.0,5.0,5.0,New,Few thousand kilometers,5.0,hyundai kona
4,Price difference between petrol and electronic...,4.0,4.0,5.0,3.0,2.0,Not Purchased,Haven't driven it,3.0,hyundai kona

In [52]:
df1 = df1.drop(columns =['review','Used it for','Owned for','Reliability','Service Experience','Extra Features','Maintenance cost'],axis=0)

In [53]:
df1.head(3)

,Ridden for,rating,Visual Appeal,Performance,Comfort,Value for Money,Model Name
0,NaN,1,3.0,NaN,4.0,1.0,TVS iQube
1,< 5000 kms,1,3.0,NaN,3.0,3.0,TVS iQube
2,< 5000 kms,3,4.0,NaN,5.0,2.0,TVS iQube

In [54]:
df2.head()

,review,Exterior,Comfort,Performance,Fuel Economy,Value for Money,Condition,driven,rating,model_name
0,Superb car like as fantastic as petroleum car....,5.0,4.0,5.0,5.0,5.0,New,Few hundred kilometers,5.0,hyundai kona
1,"Anti national, worst service, worst customer c...",1.0,1.0,1.0,1.0,1.0,New,Haven't driven it,0.0,hyundai kona
2,Super happy with it. The car is too good,4.0,5.0,5.0,5.0,4.0,New,Few thousand kilometers,5.0,hyundai kona
3,"Pretty good car, smooth as a glider fast car, ...",5.0,5.0,5.0,5.0,5.0,New,Few thousand kilometers,5.0,hyundai kona
4,Price difference between petrol and electronic...,4.0,4.0,5.0,3.0,2.0,Not Purchased,Haven't driven it,3.0,hyundai kona

In [55]:
df2 = df2.drop(columns=['review','Fuel Economy','Condition'],axis=0)

In [60]:
print('Dataset-1')
df1.head(3)

Dataset-1

,Ridden for,rating,Visual Appeal,Performance,Comfort,Value for Money,Model Name
0,NaN,1,3.0,NaN,4.0,1.0,TVS iQube
1,< 5000 kms,1,3.0,NaN,3.0,3.0,TVS iQube
2,< 5000 kms,3,4.0,NaN,5.0,2.0,TVS iQube

In [61]:
print('Dataset-2')
df2.head(3)

Dataset-2

,Exterior,Comfort,Performance,Value for Money,driven,rating,model_name
0,5.0,4.0,5.0,5.0,Few hundred kilometers,5.0,hyundai kona
1,1.0,1.0,1.0,1.0,Haven't driven it,0.0,hyundai kona
2,4.0,5.0,5.0,4.0,Few thousand kilometers,5.0,hyundai kona

In [62]:
df2 = df2.rename(columns= {'Exterior' : 'Visual Appeal','model_name' : 'Model Name' , 'driven' : 'kms_travelled'})

In [65]:
df1 = df1.rename(columns= {'Ridden for' : 'kms_travelled'})

In [66]:
df1.head(3)

,kms_travelled,rating,Visual Appeal,Performance,Comfort,Value for Money,Model Name
0,NaN,1,3.0,NaN,4.0,1.0,TVS iQube
1,< 5000 kms,1,3.0,NaN,3.0,3.0,TVS iQube
2,< 5000 kms,3,4.0,NaN,5.0,2.0,TVS iQube

In [67]:
df2.head(3)

,Visual Appeal,Comfort,Performance,Value for Money,kms_travelled,rating,Model Name
0,5.0,4.0,5.0,5.0,Few hundred kilometers,5.0,hyundai kona
1,1.0,1.0,1.0,1.0,Haven't driven it,0.0,hyundai kona
2,4.0,5.0,5.0,4.0,Few thousand kilometers,5.0,hyundai kona

In [68]:
df2['kms_travelled'].unique()

array(['Few hundred kilometers', "Haven't driven it",
       'Few thousand kilometers', 'Did a short drive once',
       'Its my mate since ages'], dtype=object)

In [69]:
df1['kms_travelled'].unique()

array([nan, '< 5000 kms', '5000-10000 kms', '> 15000 kms',
       '10000-15000 kms', 'Never owned'], dtype=object)

In [71]:
df2['kms_travelled'] = df2['kms_travelled'].map({'Few hundred kilometers' : 500 , "Haven't driven it" : 0 ,'Few thousand kilometers' : 5000 ,'Did a short drive once' : 100,'Its my mate since ages' :150000 })

In [73]:
df1['kms_travelled'] = df1['kms_travelled'].map({'< 5000 kms' : 500 ,'5000-10000 kms' : 5000 , '> 15000 kms' : 25000 ,'10000-15000 kms' : 12000 , 'Never owned':0})

In [74]:
df1.head(3)

,kms_travelled,rating,Visual Appeal,Performance,Comfort,Value for Money,Model Name
0,NaN,1,3.0,NaN,4.0,1.0,TVS iQube
1,500.0,1,3.0,NaN,3.0,3.0,TVS iQube
2,500.0,3,4.0,NaN,5.0,2.0,TVS iQube

In [75]:
df2.head(3)

,Visual Appeal,Comfort,Performance,Value for Money,kms_travelled,rating,Model Name
0,5.0,4.0,5.0,5.0,500,5.0,hyundai kona
1,1.0,1.0,1.0,1.0,0,0.0,hyundai kona
2,4.0,5.0,5.0,4.0,5000,5.0,hyundai kona

In [76]:
df1['Model Name'].unique()

array(['TVS iQube', 'Revolt RV 400', 'Bajaj Chetak', 'OLA S1 Pro',
       'Ather 450X', 'Hero Electric Optima', 'Tork Kratos', 'OLA S1',
       'Bounce Infinity E1', 'Hero Electric Optima CX',
       'Hero Electric Flash', 'Ampere Magnus EX', 'Revolt RV 300',
       'Hero Electric Photon', 'Okinawa Praise', 'Benling Aura',
       'Ampere Magnus Pro', 'PURE EV EPluto 7G', 'Ampere REO',
       'Odysse Evoqis', 'Hero Electric NYX HX', 'Okinawa i-Praise',
       'Joy e-bike Monster', 'PURE EV ETrance Neo', 'Evolet Polo',
       'Okinawa Ridge Plus', 'Ampere Zeal', 'Hero Electric Atria',
       'Okinawa Lite', 'Hero Electric NYX', 'Okinawa R30', 'Yo Drift',
       'BGauss B8', 'Joy e-bike Wolf', 'Gemopai Astrid Lite',
       'Techo Electra Emerge', 'Techo Electra Raptor', 'e-bike Gen Nxt',
       'Gemopai Ryder'], dtype=object)

In [77]:
df2['Model Name'].unique()

array(['hyundai kona', 'tata nexon ev', 'tata tigor ev'], dtype=object)

In [79]:
merged_dataset_108_109 = pd.concat([df1,df2])

In [80]:
merged_dataset_108_109.shape

(973, 7)

In [81]:
merged_dataset_108_109.head(5)

,kms_travelled,rating,Visual Appeal,Performance,Comfort,Value for Money,Model Name
0,NaN,1.0,3.0,NaN,4.0,1.0,TVS iQube
1,500.0,1.0,3.0,NaN,3.0,3.0,TVS iQube
2,500.0,3.0,4.0,NaN,5.0,2.0,TVS iQube
3,5000.0,1.0,1.0,NaN,1.0,1.0,TVS iQube
4,500.0,1.0,3.0,NaN,3.0,2.0,TVS iQube

In [82]:
merged_dataset_108_109['Model Name'].unique()

array(['TVS iQube', 'Revolt RV 400', 'Bajaj Chetak', 'OLA S1 Pro',
       'Ather 450X', 'Hero Electric Optima', 'Tork Kratos', 'OLA S1',
       'Bounce Infinity E1', 'Hero Electric Optima CX',
       'Hero Electric Flash', 'Ampere Magnus EX', 'Revolt RV 300',
       'Hero Electric Photon', 'Okinawa Praise', 'Benling Aura',
       'Ampere Magnus Pro', 'PURE EV EPluto 7G', 'Ampere REO',
       'Odysse Evoqis', 'Hero Electric NYX HX', 'Okinawa i-Praise',
       'Joy e-bike Monster', 'PURE EV ETrance Neo', 'Evolet Polo',
       'Okinawa Ridge Plus', 'Ampere Zeal', 'Hero Electric Atria',
       'Okinawa Lite', 'Hero Electric NYX', 'Okinawa R30', 'Yo Drift',
       'BGauss B8', 'Joy e-bike Wolf', 'Gemopai Astrid Lite',
       'Techo Electra Emerge', 'Techo Electra Raptor', 'e-bike Gen Nxt',
       'Gemopai Ryder', 'hyundai kona', 'tata nexon ev', 'tata tigor ev'],
      dtype=object)

In [84]:
merged_dataset_108_109.to_csv('108_109 merge.csv')

In [85]:
df3.head()

,Age,Profession,Marrital Status,Education,No of Dependents,Personal loan,House Loan,Wife Working,Salary,Wife Salary,Total Salary,Make,Price
0,27,Salaried,Single,Post Graduate,0,Yes,No,No,800000,0,800000,i20,800000
1,35,Salaried,Married,Post Graduate,2,Yes,Yes,Yes,1400000,600000,2000000,Ciaz,1000000
2,45,Business,Married,Graduate,4,Yes,Yes,No,1800000,0,1800000,Duster,1200000
3,41,Business,Married,Post Graduate,3,No,No,Yes,1600000,600000,2200000,City,1200000
4,31,Salaried,Married,Post Graduate,2,Yes,No,Yes,1800000,800000,2600000,SUV,1600000